<?php

namespace Database\Seeders;

use App\Models\Juz;
use Illuminate\Database\Seeder;

class JuzSeeder extends Seeder
{
    public function run(): void
    {
        $juzNames = [
            1 => 'الجزء الأول', 2 => 'الجزء الثاني', 3 => 'الجزء الثالث', 4 => 'الجزء الرابع', 5 => 'الجزء الخامس',
            6 => 'الجزء السادس', 7 => 'الجزء السابع', 8 => 'الجزء الثامن', 9 => 'الجزء التاسع', 10 => 'الجزء العاشر',
            11 => 'الجزء الحادي عشر', 12 => 'الجزء الثاني عشر', 13 => 'الجزء الثالث عشر', 14 => 'الجزء الرابع عشر', 15 => 'الجزء الخامس عشر',
            16 => 'الجزء السادس عشر', 17 => 'الجزء السابع عشر', 18 => 'الجزء الثامن عشر', 19 => 'الجزء التاسع عشر', 20 => 'الجزء العشرون',
            21 => 'الجزء الحادي والعشرون', 22 => 'الجزء الثاني والعشرون', 23 => 'الجزء الثالث والعشرون', 24 => 'الجزء الرابع والعشرون', 25 => 'الجزء الخامس والعشرون',
            26 => 'الجزء السادس والعشرون', 27 => 'الجزء السابع والعشرون', 28 => 'الجزء الثامن والعشرون', 29 => 'الجزء التاسع والعشرون', 30 => 'الجزء الثلاثون',
        ];

        foreach ($juzNames as $number => $name) {
            Juz::firstOrCreate(
                ['id' => $number], // نستخدم الرقم كمعرف فريد
                ['name' => $name]
            );
        }
    }
}